app/views/categories/index.html.erb

SELECT COUNT(*) FROM "items" WHERE "items"."category_id" = ?  [["category_id", 1]]
---
              <h5 class="card-title"><%= link_to category.title, category_path(category), class: 'text-success' %></h5>
               <p class="card-text"><%= pluralize(category.items.count, "Items")%></p>